Couldn't import dot_parser, loading of dot files will not be possible.
Model : AlexNet
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)               (None, 3, 224, 224) 0                                            
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)    (None, 3, 224, 224) 1089        input_1[0][0]                    
____________________________________________________________________________________________________
zeropadding2d_1 (ZeroPadding2D)    (None, 3, 226, 226) 0           convolution2d_1[0][0]            
____________________________________________________________________________________________________
lrn2d_1 (LRN2D)                    (None, 3, 226, 226) 0           zeropadding2d_1[0][0]            
____________________________________________________________________________________________________
zeropadding2d_2 (ZeroPadding2D)    (None, 3, 228, 228) 0           lrn2d_1[0][0]                    
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)      (None, 3, 57, 57)   0           zeropadding2d_2[0][0]            
____________________________________________________________________________________________________
zeropadding2d_3 (ZeroPadding2D)    (None, 3, 59, 59)   0           maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)    (None, 48, 59, 59)  435600      zeropadding2d_3[0][0]            
____________________________________________________________________________________________________
zeropadding2d_4 (ZeroPadding2D)    (None, 48, 61, 61)  0           convolution2d_2[0][0]            
____________________________________________________________________________________________________
lrn2d_2 (LRN2D)                    (None, 48, 61, 61)  0           zeropadding2d_4[0][0]            
____________________________________________________________________________________________________
zeropadding2d_5 (ZeroPadding2D)    (None, 48, 63, 63)  0           lrn2d_2[0][0]                    
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)      (None, 48, 31, 31)  0           zeropadding2d_5[0][0]            
____________________________________________________________________________________________________
zeropadding2d_6 (ZeroPadding2D)    (None, 48, 33, 33)  0           maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)    (None, 128, 33, 33) 4478976     zeropadding2d_6[0][0]            
____________________________________________________________________________________________________
zeropadding2d_7 (ZeroPadding2D)    (None, 128, 35, 35) 0           convolution2d_3[0][0]            
____________________________________________________________________________________________________
lrn2d_3 (LRN2D)                    (None, 128, 35, 35) 0           zeropadding2d_7[0][0]            
____________________________________________________________________________________________________
zeropadding2d_8 (ZeroPadding2D)    (None, 128, 37, 37) 0           lrn2d_3[0][0]                    
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)      (None, 128, 18, 18) 0           zeropadding2d_8[0][0]            
____________________________________________________________________________________________________
zeropadding2d_9 (ZeroPadding2D)    (None, 128, 20, 20) 0           maxpooling2d_3[0][0]             
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)    (None, 192, 20, 20) 4153344     zeropadding2d_9[0][0]            
____________________________________________________________________________________________________
zeropadding2d_10 (ZeroPadding2D)   (None, 192, 22, 22) 0           convolution2d_4[0][0]            
____________________________________________________________________________________________________
lrn2d_4 (LRN2D)                    (None, 192, 22, 22) 0           zeropadding2d_10[0][0]           
____________________________________________________________________________________________________
zeropadding2d_11 (ZeroPadding2D)   (None, 192, 24, 24) 0           lrn2d_4[0][0]                    
____________________________________________________________________________________________________
zeropadding2d_12 (ZeroPadding2D)   (None, 192, 26, 26) 0           zeropadding2d_11[0][0]           
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)    (None, 192, 26, 26) 6230016     zeropadding2d_12[0][0]           
____________________________________________________________________________________________________
zeropadding2d_13 (ZeroPadding2D)   (None, 192, 28, 28) 0           convolution2d_5[0][0]            
____________________________________________________________________________________________________
lrn2d_5 (LRN2D)                    (None, 192, 28, 28) 0           zeropadding2d_13[0][0]           
____________________________________________________________________________________________________
zeropadding2d_14 (ZeroPadding2D)   (None, 192, 30, 30) 0           lrn2d_5[0][0]                    
____________________________________________________________________________________________________
zeropadding2d_15 (ZeroPadding2D)   (None, 192, 32, 32) 0           zeropadding2d_14[0][0]           
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)    (None, 128, 32, 32) 17915904    zeropadding2d_15[0][0]           
____________________________________________________________________________________________________
zeropadding2d_16 (ZeroPadding2D)   (None, 128, 34, 34) 0           convolution2d_6[0][0]            
____________________________________________________________________________________________________
lrn2d_6 (LRN2D)                    (None, 128, 34, 34) 0           zeropadding2d_16[0][0]           
____________________________________________________________________________________________________
zeropadding2d_17 (ZeroPadding2D)   (None, 128, 36, 36) 0           lrn2d_6[0][0]                    
____________________________________________________________________________________________________
maxpooling2d_4 (MaxPooling2D)      (None, 128, 18, 18) 0           zeropadding2d_17[0][0]           
____________________________________________________________________________________________________
zeropadding2d_18 (ZeroPadding2D)   (None, 128, 20, 20) 0           maxpooling2d_4[0][0]             
____________________________________________________________________________________________________
flatten_1 (Flatten)                (None, 51200)       0           zeropadding2d_18[0][0]           
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 2048)        104859648   flatten_1[0][0]                  
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 2048)        0           dense_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 2048)        4196352     dropout_1[0][0]                  
____________________________________________________________________________________________________
dropout_2 (Dropout)                (None, 2048)        0           dense_2[0][0]                    
____________________________________________________________________________________________________
dense_3 (Dense)                    (None, 1000)        2049000     dropout_2[0][0]                  
====================================================================================================
Total params: 144319929
____________________________________________________________________________________________________
Model Compiled
