Couldn't import dot_parser, loading of dot files will not be possible.
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)               (None, 3, 224, 224) 0                                            
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)    (None, 3, 224, 224) 1089        input_1[0][0]                    
____________________________________________________________________________________________________
zeropadding2d_1 (ZeroPadding2D)    (None, 3, 226, 226) 0           convolution2d_1[0][0]            
____________________________________________________________________________________________________
zeropadding2d_2 (ZeroPadding2D)    (None, 3, 228, 228) 0           zeropadding2d_1[0][0]            
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)    (None, 96, 228, 228)871200      zeropadding2d_2[0][0]            
____________________________________________________________________________________________________
zeropadding2d_3 (ZeroPadding2D)    (None, 96, 230, 230)0           convolution2d_2[0][0]            
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)      (None, 96, 115, 115)0           zeropadding2d_3[0][0]            
____________________________________________________________________________________________________
lrn2d_1 (LRN2D)                    (None, 96, 115, 115)0           maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
zeropadding2d_4 (ZeroPadding2D)    (None, 96, 117, 117)0           lrn2d_1[0][0]                    
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)    (None, 192, 117, 11713436928    zeropadding2d_4[0][0]            
____________________________________________________________________________________________________
zeropadding2d_5 (ZeroPadding2D)    (None, 192, 119, 1190           convolution2d_3[0][0]            
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)      (None, 192, 59, 59) 0           zeropadding2d_5[0][0]            
____________________________________________________________________________________________________
lrn2d_2 (LRN2D)                    (None, 192, 59, 59) 0           maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
zeropadding2d_6 (ZeroPadding2D)    (None, 192, 61, 61) 0           lrn2d_2[0][0]                    
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)    (None, 288, 61, 61) 9345024     zeropadding2d_6[0][0]            
____________________________________________________________________________________________________
zeropadding2d_7 (ZeroPadding2D)    (None, 288, 63, 63) 0           convolution2d_4[0][0]            
____________________________________________________________________________________________________
zeropadding2d_8 (ZeroPadding2D)    (None, 288, 65, 65) 0           zeropadding2d_7[0][0]            
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)    (None, 288, 65, 65) 14017536    zeropadding2d_8[0][0]            
____________________________________________________________________________________________________
zeropadding2d_9 (ZeroPadding2D)    (None, 288, 67, 67) 0           convolution2d_5[0][0]            
____________________________________________________________________________________________________
zeropadding2d_10 (ZeroPadding2D)   (None, 288, 69, 69) 0           zeropadding2d_9[0][0]            
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)    (None, 256, 69, 69) 12460032    zeropadding2d_10[0][0]           
____________________________________________________________________________________________________
zeropadding2d_11 (ZeroPadding2D)   (None, 256, 71, 71) 0           convolution2d_6[0][0]            
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)      (None, 256, 35, 35) 0           zeropadding2d_11[0][0]           
____________________________________________________________________________________________________
zeropadding2d_12 (ZeroPadding2D)   (None, 256, 37, 37) 0           maxpooling2d_3[0][0]             
____________________________________________________________________________________________________
flatten_1 (Flatten)                (None, 350464)      0           zeropadding2d_12[0][0]           
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 4096)        1435504640  flatten_1[0][0]                  
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 4096)        0           dense_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 4096)        16781312    dropout_1[0][0]                  
____________________________________________________________________________________________________
dropout_2 (Dropout)                (None, 4096)        0           dense_2[0][0]                    
____________________________________________________________________________________________________
dense_3 (Dense)                    (None, 1000)        4097000     dropout_2[0][0]                  
====================================================================================================
Total params: 1506514761
____________________________________________________________________________________________________
Model Compiled
