Couldn't import dot_parser, loading of dot files will not be possible.
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)               (None, 3, 224, 224) 0                                            
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)    (None, 64, 224, 224)9408        input_1[0][0]                    
____________________________________________________________________________________________________
zeropadding2d_1 (ZeroPadding2D)    (None, 64, 226, 226)0           convolution2d_1[0][0]            
____________________________________________________________________________________________________
zeropadding2d_2 (ZeroPadding2D)    (None, 64, 228, 228)0           zeropadding2d_1[0][0]            
____________________________________________________________________________________________________
zeropadding2d_3 (ZeroPadding2D)    (None, 64, 230, 230)0           zeropadding2d_2[0][0]            
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)      (None, 64, 77, 77)  0           zeropadding2d_3[0][0]            
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)    (None, 64, 77, 77)  4096        maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)    (None, 192, 77, 77) 110592      convolution2d_2[0][0]            
____________________________________________________________________________________________________
zeropadding2d_4 (ZeroPadding2D)    (None, 192, 79, 79) 0           convolution2d_3[0][0]            
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)      (None, 192, 26, 26) 0           zeropadding2d_4[0][0]            
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)    (None, 96, 26, 26)  18432       maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)    (None, 16, 26, 26)  3072        maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)      (None, 192, 26, 26) 0           maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)    (None, 64, 26, 26)  12288       maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)    (None, 128, 26, 26) 110592      convolution2d_5[0][0]            
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)    (None, 32, 26, 26)  12800       convolution2d_7[0][0]            
____________________________________________________________________________________________________
convolution2d_9 (Convolution2D)    (None, 32, 26, 26)  6144        maxpooling2d_3[0][0]             
____________________________________________________________________________________________________
merge_1 (Merge)                    (None, 256, 26, 26) 0           convolution2d_4[0][0]            
                                                                   convolution2d_6[0][0]            
                                                                   convolution2d_8[0][0]            
                                                                   convolution2d_9[0][0]            
____________________________________________________________________________________________________
convolution2d_11 (Convolution2D)   (None, 128, 26, 26) 32768       merge_1[0][0]                    
____________________________________________________________________________________________________
convolution2d_13 (Convolution2D)   (None, 32, 26, 26)  8192        merge_1[0][0]                    
____________________________________________________________________________________________________
maxpooling2d_4 (MaxPooling2D)      (None, 256, 26, 26) 0           merge_1[0][0]                    
____________________________________________________________________________________________________
convolution2d_10 (Convolution2D)   (None, 128, 26, 26) 32768       merge_1[0][0]                    
____________________________________________________________________________________________________
convolution2d_12 (Convolution2D)   (None, 192, 26, 26) 221184      convolution2d_11[0][0]           
____________________________________________________________________________________________________
convolution2d_14 (Convolution2D)   (None, 96, 26, 26)  76800       convolution2d_13[0][0]           
____________________________________________________________________________________________________
convolution2d_15 (Convolution2D)   (None, 64, 26, 26)  16384       maxpooling2d_4[0][0]             
____________________________________________________________________________________________________
merge_2 (Merge)                    (None, 480, 26, 26) 0           convolution2d_10[0][0]           
                                                                   convolution2d_12[0][0]           
                                                                   convolution2d_14[0][0]           
                                                                   convolution2d_15[0][0]           
____________________________________________________________________________________________________
maxpooling2d_5 (MaxPooling2D)      (None, 480, 26, 26) 0           merge_2[0][0]                    
____________________________________________________________________________________________________
zeropadding2d_5 (ZeroPadding2D)    (None, 480, 28, 28) 0           maxpooling2d_5[0][0]             
____________________________________________________________________________________________________
convolution2d_17 (Convolution2D)   (None, 96, 28, 28)  46080       zeropadding2d_5[0][0]            
____________________________________________________________________________________________________
convolution2d_19 (Convolution2D)   (None, 16, 28, 28)  7680        zeropadding2d_5[0][0]            
____________________________________________________________________________________________________
maxpooling2d_6 (MaxPooling2D)      (None, 480, 28, 28) 0           zeropadding2d_5[0][0]            
____________________________________________________________________________________________________
convolution2d_16 (Convolution2D)   (None, 192, 28, 28) 92160       zeropadding2d_5[0][0]            
____________________________________________________________________________________________________
convolution2d_18 (Convolution2D)   (None, 208, 28, 28) 179712      convolution2d_17[0][0]           
____________________________________________________________________________________________________
convolution2d_20 (Convolution2D)   (None, 48, 28, 28)  19200       convolution2d_19[0][0]           
____________________________________________________________________________________________________
convolution2d_21 (Convolution2D)   (None, 64, 28, 28)  30720       maxpooling2d_6[0][0]             
____________________________________________________________________________________________________
merge_3 (Merge)                    (None, 512, 28, 28) 0           convolution2d_16[0][0]           
                                                                   convolution2d_18[0][0]           
                                                                   convolution2d_20[0][0]           
                                                                   convolution2d_21[0][0]           
____________________________________________________________________________________________________
convolution2d_23 (Convolution2D)   (None, 112, 28, 28) 57344       merge_3[0][0]                    
____________________________________________________________________________________________________
convolution2d_25 (Convolution2D)   (None, 24, 28, 28)  12288       merge_3[0][0]                    
____________________________________________________________________________________________________
maxpooling2d_7 (MaxPooling2D)      (None, 512, 28, 28) 0           merge_3[0][0]                    
____________________________________________________________________________________________________
convolution2d_22 (Convolution2D)   (None, 160, 28, 28) 81920       merge_3[0][0]                    
____________________________________________________________________________________________________
convolution2d_24 (Convolution2D)   (None, 224, 28, 28) 225792      convolution2d_23[0][0]           
____________________________________________________________________________________________________
convolution2d_26 (Convolution2D)   (None, 64, 28, 28)  38400       convolution2d_25[0][0]           
____________________________________________________________________________________________________
convolution2d_27 (Convolution2D)   (None, 64, 28, 28)  32768       maxpooling2d_7[0][0]             
____________________________________________________________________________________________________
merge_4 (Merge)                    (None, 512, 28, 28) 0           convolution2d_22[0][0]           
                                                                   convolution2d_24[0][0]           
                                                                   convolution2d_26[0][0]           
                                                                   convolution2d_27[0][0]           
____________________________________________________________________________________________________
convolution2d_29 (Convolution2D)   (None, 128, 28, 28) 65536       merge_4[0][0]                    
____________________________________________________________________________________________________
convolution2d_31 (Convolution2D)   (None, 24, 28, 28)  12288       merge_4[0][0]                    
____________________________________________________________________________________________________
maxpooling2d_8 (MaxPooling2D)      (None, 512, 28, 28) 0           merge_4[0][0]                    
____________________________________________________________________________________________________
convolution2d_28 (Convolution2D)   (None, 128, 28, 28) 65536       merge_4[0][0]                    
____________________________________________________________________________________________________
convolution2d_30 (Convolution2D)   (None, 256, 28, 28) 294912      convolution2d_29[0][0]           
____________________________________________________________________________________________________
convolution2d_32 (Convolution2D)   (None, 64, 28, 28)  38400       convolution2d_31[0][0]           
____________________________________________________________________________________________________
convolution2d_33 (Convolution2D)   (None, 64, 28, 28)  32768       maxpooling2d_8[0][0]             
____________________________________________________________________________________________________
merge_5 (Merge)                    (None, 512, 28, 28) 0           convolution2d_28[0][0]           
                                                                   convolution2d_30[0][0]           
                                                                   convolution2d_32[0][0]           
                                                                   convolution2d_33[0][0]           
____________________________________________________________________________________________________
convolution2d_35 (Convolution2D)   (None, 144, 28, 28) 73728       merge_5[0][0]                    
____________________________________________________________________________________________________
convolution2d_37 (Convolution2D)   (None, 32, 28, 28)  16384       merge_5[0][0]                    
____________________________________________________________________________________________________
maxpooling2d_9 (MaxPooling2D)      (None, 512, 28, 28) 0           merge_5[0][0]                    
____________________________________________________________________________________________________
convolution2d_34 (Convolution2D)   (None, 112, 28, 28) 57344       merge_5[0][0]                    
____________________________________________________________________________________________________
convolution2d_36 (Convolution2D)   (None, 288, 28, 28) 373248      convolution2d_35[0][0]           
____________________________________________________________________________________________________
convolution2d_38 (Convolution2D)   (None, 64, 28, 28)  51200       convolution2d_37[0][0]           
____________________________________________________________________________________________________
convolution2d_39 (Convolution2D)   (None, 64, 28, 28)  32768       maxpooling2d_9[0][0]             
____________________________________________________________________________________________________
merge_6 (Merge)                    (None, 528, 28, 28) 0           convolution2d_34[0][0]           
                                                                   convolution2d_36[0][0]           
                                                                   convolution2d_38[0][0]           
                                                                   convolution2d_39[0][0]           
____________________________________________________________________________________________________
convolution2d_41 (Convolution2D)   (None, 160, 28, 28) 84480       merge_6[0][0]                    
____________________________________________________________________________________________________
convolution2d_43 (Convolution2D)   (None, 32, 28, 28)  16896       merge_6[0][0]                    
____________________________________________________________________________________________________
maxpooling2d_10 (MaxPooling2D)     (None, 528, 28, 28) 0           merge_6[0][0]                    
____________________________________________________________________________________________________
convolution2d_40 (Convolution2D)   (None, 256, 28, 28) 135168      merge_6[0][0]                    
____________________________________________________________________________________________________
convolution2d_42 (Convolution2D)   (None, 320, 28, 28) 460800      convolution2d_41[0][0]           
____________________________________________________________________________________________________
convolution2d_44 (Convolution2D)   (None, 128, 28, 28) 102400      convolution2d_43[0][0]           
____________________________________________________________________________________________________
convolution2d_45 (Convolution2D)   (None, 128, 28, 28) 67584       maxpooling2d_10[0][0]            
____________________________________________________________________________________________________
merge_7 (Merge)                    (None, 832, 28, 28) 0           convolution2d_40[0][0]           
                                                                   convolution2d_42[0][0]           
                                                                   convolution2d_44[0][0]           
                                                                   convolution2d_45[0][0]           
____________________________________________________________________________________________________
maxpooling2d_11 (MaxPooling2D)     (None, 832, 28, 28) 0           merge_7[0][0]                    
____________________________________________________________________________________________________
convolution2d_47 (Convolution2D)   (None, 160, 28, 28) 133120      maxpooling2d_11[0][0]            
____________________________________________________________________________________________________
convolution2d_49 (Convolution2D)   (None, 32, 28, 28)  26624       maxpooling2d_11[0][0]            
____________________________________________________________________________________________________
maxpooling2d_12 (MaxPooling2D)     (None, 832, 28, 28) 0           maxpooling2d_11[0][0]            
____________________________________________________________________________________________________
convolution2d_46 (Convolution2D)   (None, 256, 28, 28) 212992      maxpooling2d_11[0][0]            
____________________________________________________________________________________________________
convolution2d_48 (Convolution2D)   (None, 320, 28, 28) 460800      convolution2d_47[0][0]           
____________________________________________________________________________________________________
convolution2d_50 (Convolution2D)   (None, 128, 28, 28) 102400      convolution2d_49[0][0]           
____________________________________________________________________________________________________
convolution2d_51 (Convolution2D)   (None, 128, 28, 28) 106496      maxpooling2d_12[0][0]            
____________________________________________________________________________________________________
merge_8 (Merge)                    (None, 832, 28, 28) 0           convolution2d_46[0][0]           
                                                                   convolution2d_48[0][0]           
                                                                   convolution2d_50[0][0]           
                                                                   convolution2d_51[0][0]           
____________________________________________________________________________________________________
convolution2d_53 (Convolution2D)   (None, 192, 28, 28) 159744      merge_8[0][0]                    
____________________________________________________________________________________________________
convolution2d_55 (Convolution2D)   (None, 48, 28, 28)  39936       merge_8[0][0]                    
____________________________________________________________________________________________________
maxpooling2d_13 (MaxPooling2D)     (None, 832, 28, 28) 0           merge_8[0][0]                    
____________________________________________________________________________________________________
convolution2d_52 (Convolution2D)   (None, 384, 28, 28) 319488      merge_8[0][0]                    
____________________________________________________________________________________________________
convolution2d_54 (Convolution2D)   (None, 384, 28, 28) 663552      convolution2d_53[0][0]           
____________________________________________________________________________________________________
convolution2d_56 (Convolution2D)   (None, 128, 28, 28) 153600      convolution2d_55[0][0]           
____________________________________________________________________________________________________
convolution2d_57 (Convolution2D)   (None, 128, 28, 28) 106496      maxpooling2d_13[0][0]            
____________________________________________________________________________________________________
merge_9 (Merge)                    (None, 1024, 28, 28)0           convolution2d_52[0][0]           
                                                                   convolution2d_54[0][0]           
                                                                   convolution2d_56[0][0]           
                                                                   convolution2d_57[0][0]           
____________________________________________________________________________________________________
averagepooling2d_1 (AveragePooling2(None, 1024, 27, 27)0           merge_9[0][0]                    
____________________________________________________________________________________________________
flatten_1 (Flatten)                (None, 746496)      0           averagepooling2d_1[0][0]         
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 1000)        746497000   flatten_1[0][0]                  
====================================================================================================
Total params: 752463272
____________________________________________________________________________________________________
Model Compiled
