Couldn't import dot_parser, loading of dot files will not be possible.
____________________________________________________________________________________________________
Layer (type)                       Output Shape        Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)               (None, 3, 224, 224) 0                                            
____________________________________________________________________________________________________
zeropadding2d_1 (ZeroPadding2D)    (None, 3, 226, 226) 0           input_1[0][0]                    
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)    (None, 64, 226, 226)1792        zeropadding2d_1[0][0]            
____________________________________________________________________________________________________
zeropadding2d_2 (ZeroPadding2D)    (None, 64, 228, 228)0           convolution2d_1[0][0]            
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)    (None, 64, 228, 228)36928       zeropadding2d_2[0][0]            
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)      (None, 64, 114, 114)0           convolution2d_2[0][0]            
____________________________________________________________________________________________________
zeropadding2d_3 (ZeroPadding2D)    (None, 64, 116, 116)0           maxpooling2d_1[0][0]             
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)    (None, 128, 116, 11673856       zeropadding2d_3[0][0]            
____________________________________________________________________________________________________
zeropadding2d_4 (ZeroPadding2D)    (None, 128, 118, 1180           convolution2d_3[0][0]            
____________________________________________________________________________________________________
convolution2d_4 (Convolution2D)    (None, 128, 118, 118147584      zeropadding2d_4[0][0]            
____________________________________________________________________________________________________
maxpooling2d_2 (MaxPooling2D)      (None, 128, 59, 59) 0           convolution2d_4[0][0]            
____________________________________________________________________________________________________
zeropadding2d_5 (ZeroPadding2D)    (None, 128, 61, 61) 0           maxpooling2d_2[0][0]             
____________________________________________________________________________________________________
convolution2d_5 (Convolution2D)    (None, 256, 61, 61) 295168      zeropadding2d_5[0][0]            
____________________________________________________________________________________________________
zeropadding2d_6 (ZeroPadding2D)    (None, 256, 63, 63) 0           convolution2d_5[0][0]            
____________________________________________________________________________________________________
convolution2d_6 (Convolution2D)    (None, 256, 63, 63) 590080      zeropadding2d_6[0][0]            
____________________________________________________________________________________________________
zeropadding2d_7 (ZeroPadding2D)    (None, 256, 65, 65) 0           convolution2d_6[0][0]            
____________________________________________________________________________________________________
convolution2d_7 (Convolution2D)    (None, 256, 65, 65) 590080      zeropadding2d_7[0][0]            
____________________________________________________________________________________________________
zeropadding2d_8 (ZeroPadding2D)    (None, 256, 67, 67) 0           convolution2d_7[0][0]            
____________________________________________________________________________________________________
convolution2d_8 (Convolution2D)    (None, 256, 67, 67) 590080      zeropadding2d_8[0][0]            
____________________________________________________________________________________________________
maxpooling2d_3 (MaxPooling2D)      (None, 256, 33, 33) 0           convolution2d_8[0][0]            
____________________________________________________________________________________________________
zeropadding2d_9 (ZeroPadding2D)    (None, 256, 35, 35) 0           maxpooling2d_3[0][0]             
____________________________________________________________________________________________________
convolution2d_9 (Convolution2D)    (None, 512, 35, 35) 1180160     zeropadding2d_9[0][0]            
____________________________________________________________________________________________________
zeropadding2d_10 (ZeroPadding2D)   (None, 512, 37, 37) 0           convolution2d_9[0][0]            
____________________________________________________________________________________________________
convolution2d_10 (Convolution2D)   (None, 512, 37, 37) 2359808     zeropadding2d_10[0][0]           
____________________________________________________________________________________________________
zeropadding2d_11 (ZeroPadding2D)   (None, 512, 39, 39) 0           convolution2d_10[0][0]           
____________________________________________________________________________________________________
convolution2d_11 (Convolution2D)   (None, 512, 39, 39) 2359808     zeropadding2d_11[0][0]           
____________________________________________________________________________________________________
zeropadding2d_12 (ZeroPadding2D)   (None, 512, 41, 41) 0           convolution2d_11[0][0]           
____________________________________________________________________________________________________
convolution2d_12 (Convolution2D)   (None, 512, 41, 41) 2359808     zeropadding2d_12[0][0]           
____________________________________________________________________________________________________
maxpooling2d_4 (MaxPooling2D)      (None, 512, 20, 20) 0           convolution2d_12[0][0]           
____________________________________________________________________________________________________
flatten_1 (Flatten)                (None, 204800)      0           maxpooling2d_4[0][0]             
____________________________________________________________________________________________________
dense_1 (Dense)                    (None, 4096)        838864896   flatten_1[0][0]                  
____________________________________________________________________________________________________
dropout_1 (Dropout)                (None, 4096)        0           dense_1[0][0]                    
____________________________________________________________________________________________________
dense_2 (Dense)                    (None, 4096)        16781312    dropout_1[0][0]                  
____________________________________________________________________________________________________
dropout_2 (Dropout)                (None, 4096)        0           dense_2[0][0]                    
____________________________________________________________________________________________________
dense_3 (Dense)                    (None, 1000)        4097000     dropout_2[0][0]                  
====================================================================================================
Total params: 870328360
____________________________________________________________________________________________________
Model Compiled
